[
    {
        "title": "Tetris AI",
        "description": "Using the Java Processing API, I rebuilt the classic game of Tetris from scratch. I then created an AI program to play the game as well as possible. The AI uses a modified A-star graph algorithm to generate all the possible end positions of a piece and the paths to them, then chooses the best position based on a collection of factors.",
        "image": "tetrisai-photo.png",
        "link": "https://github.com/nicholasmiller1/tetris-ai"
    },
    {
        "title": "3D Motion Control",
        "description": "I used the JoyShockLibrary to interface with a Nintendo Switch joycon controller and read both accelerometer and gyroscope data. I was then able to use this data to determine the orientation and position of the joycon in 3D space and visualize it. In the future, I want to reprogram my current progress in C++ to improve performance then try to interface with the joycon directly without an external library.",
        "image": "motion-photo.png",
        "link": "https://github.com/nicholasmiller1/3D-Motion-Control"
    },
    {
        "title": "Multiplayer Online Gamepack",
        "description": "I built a web app that allows multiplayer online play of games designed to be modular and easy to incorporate new games. The app uses web socket connections through SocketIO to connect players online and is able to support multiple rooms simultaneously. This allows different players to play separate lobbies and games at the same time. <br/><br/>The live website can be found <a href='https://multiplayer-online-gamepack.herokuapp.com/' target='_blank' rel='noreferrer'>here</a>",
        "image": "multiplayer-photo.png",
        "link": "https://github.com/nicholasmiller1/multiplayer-online"
    },
    {
      "title": "Embedded Computing Robot",
      "description": "As part of my embedded computing class, I designed and implemented a robust finite state machine for the TI-RSLK Max robot to solve a maze, follow complex line patterns with self-correction capabilities, and handle unexpected interruptions or resistance to operation. The project spanned a large range of progressive functionalities, each building upon the last. Initially, I built low-level functionality to handle motors, power control, and sensors using SPI, interrupts, and timer modules. Then, I built upon those foundations to implement the state machine and other functions.",
      "image": "embedded-computing-robot-photo.png",
      "link": "https://github.com/nicholasmiller1/Robot-Line-Follower"
    },
    {
      "title": "Word of Mouth Recipe Site",
      "description": "This website was built as part of a project for one of my college courses. I worked as part of a team of five developers working using an agile scrum methodology as both the Dev-ops Manager and a key developer. The website was built using the Django framework and a postgreSQL database backend. <br/><br/>The live website can be found <a href='https://group-project-a22.herokuapp.com' target='_blank' rel='noreferrer'>here</a>.",
      "image": "wom-site-photo.png",
      "link": "https://github.com/uva-cs3240-s22/group-project-a-22"
    },
    {
      "title": "Janko Whiteboard",
      "description": "I completed this project with a team of three people for the HooHacks 2022 Hackathon over a 24 hour period. We built a collaborative online whiteboard app that can support multiple concurrent sessions at different urls, each of which can be viewed and edited by multiple people at the same time. The app was built using Django and PostgreSQL to handle the frontend and simple database storage with websockets brokered over Redis used to handle realtime updates. <br/><br/>The hackathon devpost can be found <a href='https://devpost.com/software/janko-collaborative-whiteboard' target='_blank' rel='noreferrer'>here</a> and the live site can be found <a href='https://hoohacks22-janko.herokuapp.com/editpdf/editor/whiteboard' target='_blank' rel='noreferrer'>here</a>.",
      "image": "janko-whiteboard-photo.png",
      "link": "https://github.com/nicholasmiller1/hoohacks2022-pdfeditor"
    },
    {
      "title": "ILITE Robotics Website",
      "description": "A group project I lead with a team of people as part of my high school robotics team to build and maintain the team website. We used the GatsbyJS framework on top of the ReactJS library to create the website and interface with a custom-built content management system. <br/><br/>The live website can be found <a href='https://ilite.us/' target='_blank' rel='noreferrer'>here</a>.<br/>*Disclaimer: The website has continued development past my graduation from the team and the current state may not reflect my contributions.*",
      "image": "ilite-photo.png",
      "link": "https://github.com/GailDrake/iliteus"
    },
    {
        "title": "Portfolio Website",
        "description": "This very website. I created it to advertise my projects and serve as a personal portfolio as well as an extension to my resume. The website was built from scratch using ReactJS as well as simple HTML, CSS, and JavaScript technologies. The website is built and deployed through GitHub Pages.",
        "image": "portfolio-photo.png",
        "link": "https://github.com/nicholasmiller1/portfolio"
    },
    {
        "title": "Hangman Guesser",
        "description": "A simple project and one of my first with C++. I created a text-based program that provides the statiscally best (or at least very good) guesses in a game of hangman given the current known information. The program searches through a large dictionary file and calculates the current best guess dependent on a regex string generated from known letters and failed guesses.",
        "image": "hangman-photo.png",
        "link": "https://github.com/nicholasmiller1/Hangman-Guesser"
    },
    {
        "title": "Fourier Transform Display",
        "description": "In my first real project using Python, I created a program to calculate and visualize a fourier transform approximation of a given complete path. The visualization takes the form of a series of rotating vectors whose tip draws out the path. In the future, I hope to enable the program to directly take in svg files and generate the path itself to perform a fourier transform on.",
        "image": "fourier-photo.png",
        "link": "https://github.com/nicholasmiller1/PycharmProjects/tree/master/FourierTransform"
    },
    {
        "title": "Blog App",
        "description": "This project was my first experience with external databases. I built a blog web app using ReactJS that used an external Firebase database to store and manage blog posts. I also added an login/authentication system that required users to register in order to post and like. In addition, the database tracked individual user's posts and likes and allowed posts to be sorted by various criteria. <br/><br/>The live website can be found <a href='https://jovial-bartik-46166a.netlify.app/' target='_blank' rel='noreferrer'>here</a>.<br/>",
        "image": "blog-photo.png",
        "link": "https://github.com/nicholasmiller1/blog-app"
    },
    {
        "title": "Hospital Price Comparator",
        "description": "I completed this project with a team of three people for the HooHacks 2021 Hackathon over a 24 hour period. We built an app that pulled hospital price data from a large database we gathered and allowed users to compare prices among different hospitals and services according to a variety of criteria. If a given a particular hospital's price data is not found in our database, we added a feature for user's to upload a csv file containing a hospital's price data (now required to be accessible in the U.S.) to our database for comparison. <br/><br/>The hackathon devpost can be found <a href='https://devpost.com/software/hospital-app' target='_blank' rel='noreferrer'>here</a>.",
        "image": "hospital-photo.jpg",
        "link": "https://github.com/nicholasmiller1/hoohack2021-hospitalapp"
    },
    {
        "title": "Climate Request App",
        "description": "A simple project I made to explore API requests. I built a web app that requests future predicted climate data from The World Bank climate api based on country and decade. The app can display either temperature or precipitation data in both monthly average and annual average forms.",
        "image": "climate-photo.png",
        "link": "https://github.com/nicholasmiller1/social-impact-app"
    }
]